# ========================< 清空软件残留信息 >==============================

# 退出之前仿真
quit -sim

# 清空信息
.main clear

# =========================< 建立工程并仿真 >===============================

# 建立新的工程库
vlib work

# 映射逻辑库到物理目录
vmap work work

# 编译仿真文件(testbench)
vlog *.v

# 无优化simulation  *** 请修改文件名 ***
vsim -novopt -L lpm -L altera_mf -L cyclone -L altera_primitive work.tb_fsm



# =========================<     添加波形     >===============================


# =========================<     仿真时间     >===============================

run 200ns
